# GetTitle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane..::..GetTitle Method
DockablePane Class See Also
---
Returns the current title (a.k.a. window caption) of the dockable pane.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string GetTitle()
```

Visual Basic
---
```text
Public Function GetTitle As String
```

Visual C++
---
```text
public:
String^ GetTitle()
```

# See Also
DockablePane Class
Autodesk.Revit.UI Namespace